Revit 2026 API

# FormUtils Class

---

Define Form utility functions

SystemObject Autodesk.Revit.DBFormUtils

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class FormUtils
```
```vb
Public NotInheritable Class FormUtils
```
```cpp
public ref class FormUtils abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type FormUtils = class end
```

The FormUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CanBeDissolved |  |
|  | DissolveForms(Document, ICollectionElementId) |  |
|  | DissolveForms(Document, ICollectionElementId, ICollectionElementId) |  |

#### Reference

Autodesk.Revit.DB Namespace